MENU_STRUCTURE = {
    # Уровень 0
    'lvl_0': [
        '1C',  # lvl_0_0
        'Рекламации',  # lvl_0_1
        'База знаний',  # lvl_0_2
        'Сервисное обслуживание оборудования',  # lvl_0_3
        'О компании',  # lvl_0_4
        'Проверка вложенности',  # lvl_0_5
        'Техническая поддержка'  # lvl_0_6
    ],
    # Уровень 1
    'lvl_0_0': [
        'Создание Заказа Покупателя и выставление счёта_file',  # lvl_0_0_0
        'Создание отгрузочной накладной_file',  # lvl_0_0_1
        'Возврат от покупателя_file',  # lvl_0_0_2
        'Создание контрагента_file',  # lvl_0_0_3
        'Создание номенклатуры_file'  # lvl_0_0_4
    ],
    'lvl_0_1': [
        'Клён_file',  # lvl_0_1_0
        'Рестинтернешнл_file',  # lvl_0_1_1
        'Мастергласс_file',  # lvl_0_1_2
        'Регион 50 (Проект 2015)_file',  # lvl_0_1_3
        'Русский проект (Метроном)_file'  # lvl_0_1_4
    ],
    'lvl_0_2': [
        'Барный инвентарь_file',  # lvl_0_2_0
        'Сиропы, топинги, пюре_file',  # lvl_0_2_1
        'Оборудование'  # lvl_0_2_2
    ],
    'lvl_0_3': [],
    'lvl_0_4': [],
    'lvl_0_5': [
        'Первый',  # lvl_0_5_0
        'Второй',  # lvl_0_5_1
        'третий'  # lvl_0_5_2
    ],
    'lvl_0_6': [],
    # Уровень 2
    'lvl_0_0_0_file': 'Создание_Заказа_Покупателя_и_выставление_счёта.pdf',
    'lvl_0_0_1_file': 'Создание отгрузочной накладной.pdf',
    'lvl_0_0_2_file': 'Возврат от покупателя.pdf',
    'lvl_0_0_3_file': 'Создание контрагента.pdf',
    'lvl_0_0_4_file': 'Создание номенклатуры.pdf',
    'lvl_0_1_0_file': 'Клён.txt',
    'lvl_0_1_1_file': 'Рестинтернешнл.docx',
    'lvl_0_1_2_file': 'Мастергласс.txt',
    'lvl_0_1_3_file': 'Регион 50 (Проект 2015).txt',
    'lvl_0_1_4_file': 'Русский проект (Метроном).txt',
    'lvl_0_2_0_file': 'Барный инвентарь.pdf',
    'lvl_0_2_1_file': 'Сиропы, топинги, пюре.pdf',
    'lvl_0_5_0': [
        'ПодПодКатегория',  # lvl_0_5_0_0
        '2 ПодПодКатегория'  # lvl_0_5_0_1
    ],
    # Уровень 3
    'lvl_0_5_0_0': [
        'Еще вложенее'
    ]
}

# Кнопки
BACK_BUTTON = '<< Назад'
BACK_TO_MENU_BUTTON = 'В меню ↩️'

# Формат для проверки файлов.
DOC_FORMAT = ['pdf', 'txt', 'docx', 'doc']

# Сообщения
CATEGORY_MESSAGE = 'Выберите подкатегорию'
WELCOME_MESSAGE = 'Здравствуйте, что бы вы хотели узнать?'
WAIT_MESSAGE = 'Ожидайте 😊'
CHECK_MESSAGE = 'Просто проверка, ничего важного'
